src/Reports/ОтчетПоНормамПриборов/ОтчетПоНормамПриборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормамПриборов</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/СтатусыМПЗ/СтатусыМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыМПЗ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификаций</types>
      <types>EnumRef.СтатусыМПЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>Серийная</name>
  </enumValues>
  <enumValues>
    <name>Предсерийная</name>
  </enumValues>
  <enumValues>
    <name>Опытная1</name>
  </enumValues>
  <enumValues>
    <name>Опытная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Reports/ОтчетПоНормамПриборов/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ВидОтчёта = 1;
НаДату = КонецМесяца(ТекущаяДата());
	Если Константы.КодБазы.Получить() = "БГР" Тогда
	Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Богородицк УПЭА",Истина);
	Иначе	
	Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Основное производство Харьков",Истина);
	КонецЕсли;
		Если Не ОбщийМодульВызовСервера.РазрешенноеПодразделение(Подразделение) Тогда
		Сообщить("У Вас нет прав для просмотра этого отчёта!");
		Отказ = Истина;
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
Запрос = Новый Запрос;
СписокНоменклатуры = Новый СписокЗначений;
СписокТО = Новый СписокЗначений;

ВыборкаТО = Справочники.ТехОперации.ВыбратьИерархически(ГруппаТехОпераций);
	Пока ВыборкаТО.Следующий() Цикл
		Если ВыборкаТО.ЭтоГруппа Тогда
		Продолжить;	
		КонецЕсли; 
	СписокТО.Добавить(ВыборкаТО.Ссылка,ВыборкаТО.Код);
	КонецЦикла;
СписокТО.СортироватьПоПредставлению(); 
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаНормаВремени = Макет.ПолучитьОбласть("Шапка|НормаВремени");
ОблШапкаТрудоёмкость = Макет.ПолучитьОбласть("Шапка|Трудоёмкость");
ОблШапкаРасценка = Макет.ПолучитьОбласть("Шапка|Расценка");
ОблШапкаРасценкаИтого = Макет.ПолучитьОбласть("Шапка|РасценкаИтого");
ОблМПЗОбщая = Макет.ПолучитьОбласть("МПЗ|Общая");
ОблМПЗНормаВремени = Макет.ПолучитьОбласть("МПЗ|НормаВремени");
ОблМПЗТрудоёмкость = Макет.ПолучитьОбласть("МПЗ|Трудоёмкость");
ОблМПЗРасценка = Макет.ПолучитьОбласть("МПЗ|Расценка");
ОблМПЗРасценкаИтого = Макет.ПолучитьОбласть("МПЗ|РасценкаИтого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецНормаВремени = Макет.ПолучитьОбласть("Конец|НормаВремени");
ОблКонецТрудоёмкость = Макет.ПолучитьОбласть("Конец|Трудоёмкость");
ОблКонецРасценка = Макет.ПолучитьОбласть("Конец|Расценка");
ОблКонецРасценкаИтого = Макет.ПолучитьОбласть("Конец|РасценкаИтого");	

ОблШапкаОбщая.Параметры.НаДату = Формат(Отчет.НаДату,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщая);
	Если ВидОтчёта = 1 Тогда
		Для каждого ТО Из СписокТО Цикл	
		ОблШапкаНормаВремени.Параметры.ТО = ТО.Значение;
		ТабДок.Присоединить(ОблШапкаНормаВремени);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблШапкаТрудоёмкость);
	Иначе	
		Для каждого ТО Из СписокТО Цикл	
		ОблШапкаРасценка.Параметры.ТО = ТО.Значение;
		ТабДок.Присоединить(ОблШапкаРасценка);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблШапкаРасценкаИтого);
	КонецЕсли;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)";
Запрос.УстановитьПараметр("ГруппаНоменклатуры",ГруппаНоменклатуры);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Если Не ПоказыватьЗапрещённые Тогда
	Запрос.Текст = Запрос.Текст + " И СтатусыМПЗСрезПоследних.Статус <> &Статус";	
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
	КонецЕсли; 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка,глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование));
	КонецЦикла;
СписокНоменклатуры.СортироватьПоПредставлению();
	Для каждого МПЗ Из СписокНоменклатуры Цикл 
	ОблМПЗОбщая.Параметры.Наименование = СокрЛП(МПЗ.Значение.Наименование);
	ОблМПЗОбщая.Параметры.МПЗ = МПЗ.Значение;
	ОблМПЗОбщая.Параметры.Статус = ПолучитьСтатус(МПЗ.Значение,Отчет.НаДату);
	ТабДок.Вывести(ОблМПЗОбщая);
		Если ВидОтчёта = 1 Тогда
		Трудоёмкость = 0;
			Для каждого ТО Из СписокТО Цикл
			НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ТехОперация",МПЗ.Значение,ТО.Значение));
			ОблМПЗНормаВремени.Параметры.НВ = НормыВремени.НормаВремени;
			ТабДок.Присоединить(ОблМПЗНормаВремени);
			Трудоёмкость = Трудоёмкость + НормыВремени.НормаВремени;
			КонецЦикла;
		ОблМПЗТрудоёмкость.Параметры.Трудоёмкость = Трудоёмкость;
		ТабДок.Присоединить(ОблМПЗТрудоёмкость);
		Иначе
		РасценкаИтого = 0;
			Для каждого ТО Из СписокТО Цикл
			НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ТехОперация",МПЗ.Значение,ТО.Значение));
			ОблМПЗНормаВремени.Параметры.НВ = НормыВремени.НормаВремени;
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("ТехОперация",ТО.Значение));
			Расценка = НормыВремени.НормаВремени/60*НормыТО.Стоимость;
			ОблМПЗРасценка.Параметры.Расценка = Расценка;
			ТабДок.Присоединить(ОблМПЗРасценка);
			РасценкаИтого = РасценкаИтого + Расценка;
			КонецЦикла;
		ОблМПЗРасценкаИтого.Параметры.РасценкаИтого = РасценкаИтого;
		ТабДок.Присоединить(ОблМПЗРасценкаИтого);
		КонецЕсли;
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщая);
	Если ВидОтчёта = 1 Тогда
		Для каждого ТО Из СписокТО Цикл	
		ТабДок.Присоединить(ОблКонецНормаВремени);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблКонецТрудоёмкость);
	Иначе	
		Для каждого ТО Из СписокТО Цикл	
		ТабДок.Присоединить(ОблКонецРасценка);				
		КонецЦикла;
 	ТабДок.Присоединить(ОблКонецРасценкаИтого);
	КонецЕсли;
ТабДок.ФиксацияСверху = 2;
ТабДок.ФиксацияСлева = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры
